In [1]:
import pandas as pd
df = pd.DataFrame({'spa1':[1,2,3,4],'spa2':[444,555,666,444],'spa3':['abc','def','ghi','xyz']})
df.head()

   spa1  spa2 spa3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['spa2'].unique()

array([444, 555, 666])

In [6]:
df['spa2'].nunique()

3

In [7]:
df['spa2'].value_counts()

444    2
555    1
666    1
Name: spa2, dtype: int64

In [12]:
newdf = df[(df['spa1']>2) & (df['spa2']==444)]

In [13]:
newdf

   spa1  spa2 spa3
3     4   444  xyz

In [14]:
def mal2(x):
    return x*2

In [15]:
df['spa1'].apply(mal2)

0    2
1    4
2    6
3    8
Name: spa1, dtype: int64

In [16]:
df['spa3'].apply(len)

0    3
1    3
2    3
3    3
Name: spa3, dtype: int64

In [17]:
df['spa2'].apply(lambda x :x*2)

0     888
1    1110
2    1332
3     888
Name: spa2, dtype: int64

In [18]:
df['spa1'].sum()

10

In [19]:
df['spa1'].min()

1

In [20]:
df.drop('spa1', axis=1) # inplace

   spa2 spa3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [21]:
del df['spa1']

In [22]:
df

   spa2 spa3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [23]:
df.columns

Index(['spa2', 'spa3'], dtype='object')

In [24]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [26]:
df.sort_values(by='spa2', inplace=True)

In [27]:
df.isnull()

    spa2   spa3
0  False  False
3  False  False
1  False  False
2  False  False

In [28]:
df.dropna()

   spa2 spa3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [30]:
import numpy as np
df = pd.DataFrame({'spa1':[1,2,3,np.nan],
                   'spa2':[np.nan,555,666,444],
                   'spa3':['abc','def','ghi','xyz']})
df.head()

   spa1   spa2 spa3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [31]:
df.fillna(0)

   spa1   spa2 spa3
0   1.0    0.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   0.0  444.0  xyz

In [32]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [33]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [36]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN